[
"Clouds come floating into my life, no longer to carry rain or usher storm, but to add color to my sunset sky. - Rabindranath Tagore",
"I slept and dreamt that life was joy. I awoke and saw that life was service. I acted and behold, service was joy. - Rabindranath Tagore",
"Faith is the bird that feels the light when the dawn is still dark. - Rabindranath Tagore",
"You can't cross the sea merely by standing and staring at the water. - Rabindranath Tagore",
"Let your life lightly dance on the edges of Time like dew on the tip of a leaf. - Rabindranath Tagore",
"Death is not extinguishing the light; it is only putting out the lamp because the dawn has come. - Rabindranath Tagore",
"Every child comes with the message that God is not yet discouraged of man. - Rabindranath Tagore",
"Beauty is truth's smile when she beholds her own face in a perfect mirror. - Rabindranath Tagore",
"Trees are the earth's endless effort to speak to the listening heaven. - Rabindranath Tagore",
"Everything comes to us that belongs to us if we create the capacity to receive it. - Rabindranath Tagore",
"Do not say, 'It is morning,' and dismiss it with a name of yesterday. See it for the first time as a newborn child that has no name. - Rabindranath Tagore",
"What is Art? It is the response of man's creative soul to the call of the Real. - Rabindranath Tagore",
"Don't limit a child to your own learning, for he was born in another time. - Rabindranath Tagore",
"Let us not pray to be sheltered from dangers but to be fearless when facing them. - Rabindranath Tagore",
"By plucking her petals, you do not gather the beauty of the flower. - Rabindranath Tagore",
"Love is the only reality and it is not a mere sentiment. It is the ultimate truth that lies at the heart of creation. - Rabindranath Tagore",
"If you shut the door to all errors, truth will be shut out. - Rabindranath Tagore",
"The water in a vessel is sparkling; the water in the sea is dark. The small truth has words which are clear; the great truth has great silence. - Rabindranath Tagore",
"Emancipation from the bondage of the soil is no freedom for the tree. - Rabindranath Tagore",
"The flower which is single need not envy the thorns that are numerous. - Rabindranath Tagore",
"Love is an endless mystery, for it has nothing else to explain it. - Rabindranath Tagore",
"We come nearest to the great when we are great in humility. - Rabindranath Tagore",
"He who is too busy doing good finds no time to be good. - Rabindranath Tagore",
"The burden of the self is lightened with I laugh at myself. - Rabindranath Tagore",
"To be outspoken is easy when you do not wait to speak the complete truth. - Rabindranath Tagore",
"Love is not a mere impulse, it must contain truth, which is law. - Rabindranath Tagore"
]
